malbanGit/ESP32_P4_Vectrex/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#


CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_SPEED=200
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=16384
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y
#CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=10

CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y


#
# SD/MMC Example Configuration
#
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=4096
CONFIG_EXAMPLE_FORMAT_IF_MOUNT_FAILED=n
CONFIG_EXAMPLE_FORMAT_SD_CARD=n
CONFIG_EXAMPLE_SDMMC_BUS_WIDTH_4=y
# CONFIG_EXAMPLE_SDMMC_BUS_WIDTH_1 is not set
CONFIG_EXAMPLE_SDMMC_SPEED_DS=y
# CONFIG_EXAMPLE_SDMMC_SPEED_HS is not set
# CONFIG_EXAMPLE_SDMMC_SPEED_UHS_I_SDR50 is not set
# CONFIG_EXAMPLE_SDMMC_SPEED_UHS_I_DDR50 is not set
# CONFIG_EXAMPLE_SDMMC_SPEED_UHS_I_SDR104 is not set
CONFIG_EXAMPLE_PIN_CARD_POWER_RESET=45
CONFIG_EXAMPLE_PIN_CMD=44
CONFIG_EXAMPLE_PIN_CLK=43
CONFIG_EXAMPLE_PIN_D0=39
CONFIG_EXAMPLE_PIN_D1=40
CONFIG_EXAMPLE_PIN_D2=41
CONFIG_EXAMPLE_PIN_D3=42
# CONFIG_EXAMPLE_DEBUG_PIN_CONNECTIONS is not set
CONFIG_EXAMPLE_SD_PWR_CTRL_LDO_INTERNAL_IO=y
CONFIG_EXAMPLE_SD_PWR_CTRL_LDO_IO_ID=4
# end of SD/MMC Example Configuration

# -----------------------------------------------------------------------------
# gamepad test: BLE host on the P4, BT controller on the C6, HCI multiplexed on
# the SDIO link that already carries WiFi (VHCI).  The SDIO settings themselves
# are already in sdkconfig, inherited from `station`.
#
# WARNING: these lines only take effect on a FRESH sdkconfig.  Once a symbol
# exists in sdkconfig, neither sdkconfig.defaults nor a Kconfig default will ever
# change it again -- `idf.py reconfigure` only ADDS missing symbols.  To apply
# them to the existing config, either set them in menuconfig, or delete sdkconfig
# and rebuild.
# -----------------------------------------------------------------------------
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y

# Central role, legacy advertising, persistent bonds.
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_EXT_ADV=n
# Reduce NimBLE's pool sizes — you only need 2 connections max
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=12
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=0
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# HCI buffers for the VHCI transport (from the ODM deployment guide, section 5).
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=48
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=48

# Disable SM if you don't need encrypted pairing (simplest HID devices don't)
CONFIG_BT_NIMBLE_SM_LEGACY=n
CONFIG_BT_NIMBLE_SM_SC=n

# Move NimBLE buffer pools to PSRAM instead of internal DRAM
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y

CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=4
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_HOST_COUNT=4
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_GATT_SERVER=y

